<template><h2 id="サーモンランにはブロックが効かない" tabindex="-1"><a class="header-anchor" href="#サーモンランにはブロックが効かない" aria-hidden="true">#</a> サーモンランにはブロックが効かない</h2>
<p>ガチマッチではブロックしたユーザとはマッチングしないようにできるのだが、サーモンランではブロックが効かないという報告が多数挙がってきている。</p>
<p>とすれば、なんとか自衛するしかないのだがブロックが効かない以上どうすればいいのかわからない。ならばブロックしたユーザとマッチングしたら四人が揃う前にスイッチをスリープにするなどして抜けてしまうのが一つの方法として考えられる。</p>
<p>これなら評価は下がらないし、一人抜ければまた誰か別の一人が補充される。タイミングが悪いと三オペで始まってしまう可能性もあるがまあ今回はこれは発生しないとしよう。</p>
<h2 id="注意人物リストをつくった" tabindex="-1"><a class="header-anchor" href="#注意人物リストをつくった" aria-hidden="true">#</a> 注意人物リストをつくった</h2>
<p><a href="https://festive-morse-4a7fe5.netlify.app/" target="_blank" rel="noopener noreferrer">Warning Players List<OutboundLink/></a></p>
<p>ただ、単純にリストをつくっても当然相手は名前を変えることも考えられるし、画像だって変えるだろう（まあ画像は変えても確かめるすべはないが）</p>
<p>なので、名前を変えていても追跡できるような仕組みがあれば良い。幸い、任天堂の非公式 API でプレイヤー ID から画像と現在のニックネームを取得できるものがあるのでそれを利用することにした。</p>
<p>前回試した感じだと、一度に 500 人くらいは一括に要求できるようだ。ただ、この API は CORS 制限がかかっているので GAS を使ってラッパー API を作り、ブラウザからも叩けるようにした。</p>
<p>GAS の制限上、一日に 20000 回までしかアクセスできないという制約はあるがまあそんなにアクセスする人もいないだろう。キャッシュみたいな仕組みが使えたら良いのだが、よくわからなかったので今回は実装を見送った。</p>
<h2 id="注意点" tabindex="-1"><a class="header-anchor" href="#注意点" aria-hidden="true">#</a> 注意点</h2>
<p>建前上、あくまでこれは個人的な注意人物リストということにしておく。</p>
<p>本当に荒らしかどうか信じるか信じないかは個人の自由だし、このリストを参考にしたいのであればそれでいい。</p>
<p>ただ、自分はなるべく荒らしとマッチングしたくないので人から報告があればこのリストにはどんどん加えていく。</p>
<p>記事は以上。</p>
</template>
