<template><h2 id="背景" tabindex="-1"><a class="header-anchor" href="#背景" aria-hidden="true">#</a> 背景</h2>
<p>うちには現在二台のパソコンがあります。</p>
<p>デスクトップのメイン機と、アプリ開発するための Macbook Pro です。</p>
<p>ところが、実際には Macbook Pro は<a href="https://support.apple.com/ja-jp/HT201834" target="_blank" rel="noopener noreferrer">クラムシェルモード<OutboundLink/></a>と呼ばれる本体はずっと閉じたままで外部のディスプレイをモニタとして使う方式で運用しています。</p>
<p>つまり、デュアルモニタがあってそれらはメイン機の画面を映すときもあれば、Macbook Pro の画面を映すときもあるわけです。</p>
<p>幸い、最近のモニタは二つ以上の入力端子を備えているので、ボタンをポチッと押せば簡単に画面は切り替えることができます。</p>
<p>ちなみに使っているのはこのモニタです。</p>
<p>端子は DP が 1 つと HDMI が 2 つなんですけど、なぜか HDMI2 だけが HDMI2.0 に対応していて 4K60Hz で出力できます。</p>
<p>HDMI1 の方は HDMI1.4 にしか対応していない、何故(´・ω・｀)ｼｮﾎﾞｰﾝ</p>
<p>全く関係ないけど買うと個人的に幸せになれそうなモニタはこれ。</p>
<p>4K で IPS で 27 インチで HDR 対応なので文句なし。メーカーも DELL なのでサポートは割と安心。</p>
<p>IPS 液晶にこだわらないならこれもアリ。HDMI2.0 × 2 + DP1.4 なので三つの入力端子全てが 4K60Hz に対応している。</p>
<h2 id="困ったこと" tabindex="-1"><a class="header-anchor" href="#困ったこと" aria-hidden="true">#</a> 困ったこと</h2>
<p>で、困ったことというのは二つのパソコンが同じモニタに繋がっているのに、キーボードとマウスが一つずつしかないせいでいちいち USB を差し替えないと動かせなかったことです。</p>
<p>同じもの二つ買えばええやん？って思うかもしれないでしょ、ぼくもそう思いました。</p>
<p>今使ってるのはこれの旧モデルなんですけど、えっなにこの新モデルダサすぎません？センス大丈夫？？？</p>
<p>マウスはこれの旧モデルの G900 ってやつを使ってます。</p>
<p>で、見ればわかるように同じものを二つ買うには少々値が張るのです。5000 円くらいなら合わせても 10000 円なので即ポチしちゃうんですけどね。</p>
<h3 id="usb-切り替え器を買ってみた" tabindex="-1"><a class="header-anchor" href="#usb-切り替え器を買ってみた" aria-hidden="true">#</a> USB 切り替え器を買ってみた</h3>
<p>アマゾンで「USB 切替器」って調べると色々でてくるのですが、自分は結局これにしました。</p>
<p>これにした理由をいくつか述べます。</p>
<ul>
<li>販売元がエレコムなので安心
<ul>
<li>他はよくわからん中華業者だった</li>
</ul>
</li>
<li>マウスとキーボード繋ぎたいだけなのでポートは二つで十分
<ul>
<li>HDD とか繋ごうとするとバスパワーだけでは足りないので注意が必要</li>
</ul>
</li>
<li>手元においておくスイッチがあるのが良い
<ul>
<li>他のやつはアダプタ自体がスイッチになっている</li>
</ul>
</li>
</ul>
<p>で、他のやつがどんなやつかというとこんなやつです。</p>
<p>デザインは悪くはないんですが、ケーブルが柔軟性がなくて太い割にアダプタ自体が軽いのですぐ動いちゃうらしいんですよね。</p>
<p>USB3.0 のオスオスケーブルなんていうのも需要がないのか全くなくて（しかも高い）、代替も利かないので買うのをやめました。</p>
<p>USB3.0 対応で 4 ポート対応っていうのはちょっと羨ましかったんですけど。</p>
<p>それこそ CalDigit のドッキングステーション並みにどっしりしてたほうが嬉しかったですね。</p>
<h2 id="使ってみた感想" tabindex="-1"><a class="header-anchor" href="#使ってみた感想" aria-hidden="true">#</a> 使ってみた感想</h2>
<p>めっちゃ便利でワロタｗｗｗｗｗｗｗｗｗｗｗｗｗｗｗｗｗｗｗｗｗｗｗｗｗｗｗｗｗｗｗｗ</p>
<p>いや、これほんと便利ですね。</p>
<p>ボタン一つでキーボードとマウスを一瞬で切り替えられるので、ストレスフリーです。</p>
<p>あと、こういう延長系のケーブルって無線接続と相性悪いイメージがあるのですが、例えば無線の受信機をこのケーブルに挿してマウスを無線で使って切り替えることってできるんでしょうか？</p>
<p>キーボードは Bluetooth なので受信機を二つ買えば切り替えは楽なんですけど、ロジクールのマウスは専用のアダプタを使っているので簡単に二つは用意できないんですよね。</p>
<p>例えばぼくが使っている G900 のレシーバなんてそもそも G900 がもう販売してないこともあって 5000 円超えてるんですよね。</p>
<p>というか、そもそもずっと有線しか使ってないので多分レシーバどっか捨てちゃいました。</p>
<p>マウスとキーボードは有線じゃないとなあというレトロ派なぼくでしたとさ。</p>
<p>記事は以上。</p>
</template>
