<template><h2 id="イカちゃんの身長の探求" tabindex="-1"><a class="header-anchor" href="#イカちゃんの身長の探求" aria-hidden="true">#</a> イカちゃんの身長の探求</h2>
<p>有志により、さまざまな試みによりインクリングの身長は求められている。</p>
<h3 id="_40cm-説" tabindex="-1"><a class="header-anchor" href="#_40cm-説" aria-hidden="true">#</a> 40cm 説</h3>
<blockquote class="twitter-tweet tw-align-center"><p lang="ja" dir="ltr">一斗缶との比較　身長150cmくらいはあると思ってたんですけど <a href="https://twitter.com/hashtag/Splatoon2?src=hash&amp;ref_src=twsrc%5Etfw">#Splatoon2</a> <a href="https://twitter.com/hashtag/%E3%82%B9%E3%83%97%E3%83%A9%E3%83%88%E3%82%A5%E3%83%BC%E3%83%B32?src=hash&amp;ref_src=twsrc%5Etfw">#スプラトゥーン2</a> <a href="https://twitter.com/hashtag/NintendoSwitch?src=hash&amp;ref_src=twsrc%5Etfw">#NintendoSwitch</a> <a href="https://t.co/sK2A7UYXht">pic.twitter.com/sK2A7UYXht</a></p>&mdash; まーこっと (@Murcott44) <a href="https://twitter.com/Murcott44/status/1079934140558921728?ref_src=twsrc%5Etfw">January 1, 2019</a></blockquote> <script async src="https://platform.twitter.com/widgets.js" charset="utf-8"></script>
<p>これはある意味正しい考察ではあるが、スプラトゥーンの世界でも一斗缶の大きさが現在の一斗缶の大きさと同じとは限らないので正確性には疑問が残る。</p>
<h3 id="_66cm-説" tabindex="-1"><a class="header-anchor" href="#_66cm-説" aria-hidden="true">#</a> 66cm 説</h3>
<p>@<a href="https://www.youtube.com/watch?v=JMouk6UTIYg" target="_blank" rel="noopener noreferrer">youtube<OutboundLink/></a></p>
<p>興味深い考察なのだが、計算式が明らかにされておらず追試できない。</p>
<h3 id="_150cm-説" tabindex="-1"><a class="header-anchor" href="#_150cm-説" aria-hidden="true">#</a> 150cm 説</h3>
<blockquote class="twitter-tweet tw-align-center"><p lang="ja" dir="ltr">インクリングの身長…1のミステリーファイルには「イカ足:ひと跳び150cm」という記述があります。さらにゲーム中ではヒト形態のイカたちは長押しでジャンプをした際に自分の身長ほど飛べる。よってイカたち(ヒト形態)はおよそ150cmである。　<br><br>という説はよく聞きますが…イカ形態はどうなんでしょう。</p>&mdash; H.N.MIKAGE/ミカゲ (@handlemikage) <a href="https://twitter.com/handlemikage/status/1042667831639212032?ref_src=twsrc%5Etfw">September 20, 2018</a></blockquote> <script async src="https://platform.twitter.com/widgets.js" charset="utf-8"></script>
<p>もっともしっくりくる説だが、ひと跳びが何のことを意味するのか（ひょっとしたらスーパージャンプのことかもしれない）不明なため、さらなる検証が必要である。</p>
<p>が、概ねこの説が正しいとして検証を開始した。</p>
<h2 id="正しい身長の測定方法とは" tabindex="-1"><a class="header-anchor" href="#正しい身長の測定方法とは" aria-hidden="true">#</a> 正しい身長の測定方法とは</h2>
<p>40cm 説における一斗缶の大きさとの比較は、一斗缶の大きさが不変であれば確実に正しい答えを導けるが、12000 年後にも一斗缶が今と同じ大きさである保証はない。</p>
<p>豊臣秀吉が古マスを京マスに変えたように、お偉いインクリングが「一斗缶の大きさ変えよう」と言い出すとも限らないわけである。</p>
<p>66cm 説は極めて合理的な推論から求められた結果であるが、その計算の複雑さ故に誤差を招きやすく、かつ計算の過程が一切明らかにされていないので追試ができない。</p>
<p>150cm 説は最も単純ではあるが「ひと跳び」が意味するものがはっきりせず、確証には至れない。</p>
<p>では、どうやってイカちゃんの身長を求めればよいだろうか？</p>
<h3 id="万有引力定数を用いる" tabindex="-1"><a class="header-anchor" href="#万有引力定数を用いる" aria-hidden="true">#</a> 万有引力定数を用いる</h3>
<blockquote>
<p>万有引力定数（ばんゆういんりょくていすう）あるいは（ニュートンの）重力定数（じゅうりょくていすう、英: (Newtonian) constant of gravitation）とは、重力相互作用の大きさを表す物理定数である。アイザック・ニュートンの万有引力の法則において導入された。記号は一般に G で表される。</p>
<p>https://ja.wikipedia.org/wiki/万有引力定数</p>
</blockquote>
<p>万有引力定数とはアイザック・ニュートンが導入した重力相互作用の大きさを表す物理定数である。</p>
<p>物理定数はある特異点を除き全宇宙の全ての場所で等しい値を持ちます。場所が火星だろうと、木星だろうと、太陽だろうと同じです。当然、12000 年後の地球でも値は変わりません。</p>
<p>「え、でもそれって現実の話でしょ...？今はスプラトゥーンの話してるのに...ゲームと現実の区別がつかないなんて犯罪者予備軍？？」とか思ったそこのあなた！！それは大いに間違っています。</p>
<h3 id="物理エンジン" tabindex="-1"><a class="header-anchor" href="#物理エンジン" aria-hidden="true">#</a> 物理エンジン</h3>
<p>というのも、FPS や TPS などでは最近はリアリティを重視して物理エンジンを搭載しているのがもはや常識になっているからです。</p>
<p>例えば、ジャンプ一つにしても今までは何フレーム目にキャラクターをこれだけ上昇させてーとかいちいちプログラマが調整していたわけです。「このキャラクターもうちょっとジャンプ力あげよう」だなんて言われた日にはまたパラメータを打ち直す作業が必要だったわけですが、今は物理エンジンのおかげでキャラクターが飛び上がる強さだけを入力すればあとは勝手に物理エンジンが t 秒後のキャラクターの位置を計算してくれます。</p>
<p>これは、ジャンプだけにとどまらず弾丸の落下や物体の投擲、光の反射など応用場面は数え切れません。</p>
<p>もはやゲームは現実世界の投影になりつつあるのです。</p>
<h3 id="イカちゃんのジャンプに注目する" tabindex="-1"><a class="header-anchor" href="#イカちゃんのジャンプに注目する" aria-hidden="true">#</a> イカちゃんのジャンプに注目する</h3>
<p>本論の主張はこうである。</p>
<p>万有引力定数は 12000 年後も変わっていないはずである。</p>
<p>であれば、イカちゃんたちが住んでいるのが地球であれば重力加速度も容易に求められます。</p>
<p>すると例えば初速 0 から落下に t 秒かかったということがわかれば、物体がどのくらいの高さにあったか、小数点以下 5 桁ほどの精度で計算できます。</p>
<p>つまり、調べるのはイカちゃんがジャンプして再び地面に足をつくまでの時間なのです。これならば複雑な計算を必要とせずに計測できますね！！</p>
<p><img src="https://pbs.twimg.com/media/E348LssVoAAMmMm?format=png" alt=""></p>
<p>1 フレーム目。</p>
<p>最高到達点を調べるのだが、足は若干折り曲げた感じになっているので測定にふさわしくない。そこで相対的な位置が変わらない腰の位置に注目し、最高到達点に達するまでのフレーム数を調べた。</p>
<p>すると、およそ 30 フレーム目付近で最も高く飛び上がっていることがわかった。</p>
<p>1 秒間に 60 フレーム録画しているので、30 フレームとは 0.5 秒に相当する。既存の物理法則が正しく働いているなら上昇にかかる時間と落下にかかる時間は同じはずなのだが、さてどうなっているか...</p>
<p>すると 57 フレーム目付近でイカちゃんの足が地面についていることが確認できた。正確に半分、とはなってはいないがジャンプの仕方や足の付き方などでこの辺りはいくらでも誤差が生まれるものである。</p>
<p>システム的にも通常のジャンプは 60 フレーム飛べると考えるのが一般的だろう。</p>
<p>重力によって物体が落下する場合、その落下時間はイカの式で求めることができる。</p>
<p>$s=\frac{1}{2}gt^2$</p>
<p>今回の場合、イカちゃんが落下するのにかかる時間は 0.5 秒であるので、</p>
<p>$s=\frac{1}{2}×9.80665×(0.5)^2=1.22583125$</p>
<p>計算上はインクリングの垂直跳びの記録はおよそ 123cm であることがわかります。成人男性の平均が 55.2cm 程度らしいので、イカちゃんはめっちゃジャンプ力が強いということに...</p>
<p>イカすアートブックによると「イカ足はひと跳び 150cm」とあるので、真面目にやれば 150cm は跳べるらしい。このイカちゃんはどう見ても軽くこなしているので 8 割くらいの力を出したとしたら 120cm 前後でも決しておかしくない数字になります。</p>
<div class="vuepress-affiliate">
<img src="https://m.media-amazon.com/images/I/616x8yxKnqL._SL200_.jpg"></img>
<ul>
<li><a href="https://www.amazon.co.jp/dp/4047330736/?tag=tkgstrator0f-22" target="_blank">スプラトゥーン イカすアートブック (ファミ通の攻略本)</a></li>
<li class="price">￥4,180 (コレクター商品)</li>
</ul>
</div>
<blockquote>
<p>ミズノスポーツ科学研究所が調べた平均値は、野球選手が65.5cm、サッカー選手が61.2cm、ラグビー選手が58.9cm、陸上短距離選手が73.2cm、一般成人（25〜34歳）が55.2cmとなっている。</p>
<p>https://ja.wikipedia.org/wiki/垂直跳び</p>
</blockquote>
<h2 id="身長を測定する" tabindex="-1"><a class="header-anchor" href="#身長を測定する" aria-hidden="true">#</a> 身長を測定する</h2>
<p><img src="https://pbs.twimg.com/media/E348NBhVkAMUsKo?format=png" alt=""></p>
<p>電信柱とイカちゃん。</p>
<p>電信柱の目印とイカちゃんの身長がほぼ同じことに注目していただきたい。</p>
<p><img src="https://pbs.twimg.com/media/E348OQ4VcAczVUT?format=png" alt=""></p>
<p>ジャンプ！</p>
<p>この状態でジャンプをするとつま先がほぼ目印と同じ高さまで上昇していることがわかる。つまり、この目印の位置がおよそ 123cm であることがわかります。</p>
<p>ということは？</p>
<p>イカちゃんの身長はおよそ 120 ~ 125cm ということになります。</p>
<p>また、これは広場に立っている他のインクリングをジャンプでギリギリ超えられないことからも裏付けられます。</p>
<h2 id="矛盾点" tabindex="-1"><a class="header-anchor" href="#矛盾点" aria-hidden="true">#</a> 矛盾点</h2>
<p>しかし、この 123cm という推測は簡単に論破されてしまいます。</p>
<p>それが amiibo の撮影で行えるヒメちゃんとの身長比較です。</p>
<p><img src="https://pbs.twimg.com/media/E348Pb5VEAEancy?format=png" alt=""></p>
<p>ヒメちゃんとの比較。</p>
<div class="vuepress-affiliate">
<img src="https://m.media-amazon.com/images/I/61-BUSdVyVL._SL200_.jpg"></img>
<ul>
<li><a href="https://www.amazon.co.jp/dp/4047332690/?tag=tkgstrator0f-22" target="_blank">スプラトゥーン2 イカすアートブック</a></li>
<li class="price">￥4,435</li>
</ul>
</div>
<p>イカすアートブック 2 によればヒメちゃんの身長は 145cm で、イイダさんの身長は 178cm のはずである。</p>
<p>つまり、本当にイカちゃんの身長が 120cm 前後であるならヒメちゃんと並んだときに一回り小さく見えなければおかしいのです。ところが、実際にヒメちゃんと撮影をしてみると、どう見ても身長は同じくらいか若干イカちゃんのほうが高いように見えます。</p>
<p>これは一体どういうことか...</p>
<p>これならむしろイカちゃんの身長が 150cm という方が納得がいきます。</p>
<p>しかし、どうみてもイカちゃんの身長はジャンプしたときよりも 30cm 以上も高いようには見えません...一体何がこの誤解を産んだのか...</p>
<p>そうか！重力加速度が変わったんだ（錯乱）！！</p>
<h3 id="地下ドームの設定を活かす" tabindex="-1"><a class="header-anchor" href="#地下ドームの設定を活かす" aria-hidden="true">#</a> 地下ドームの設定を活かす</h3>
<p>要はイカちゃんが高くジャンプできればいいわけです。月は地球の重力のおよそ $\frac{1}{6}$ なので、月に行けば走り幅跳びの記録は地球記録の 6 倍くらいでることになります。</p>
<p>イカちゃんの場合は 123cm が 150cm になればいいだけなので 6 倍も変化する必要はありません。</p>
<p>重力加速度がちょっと弱くなればいいのでは？</p>
<p>オクタリアンが生活している地下ドームは人類が建造した最後の大型建築物です。当然、地下を掘れば土が出ます。</p>
<p>想像もつかないほど巨大な地下ドームを作ればその土をどこにやるかという問題が生じます。地上は残り少ない、海に捨てれば余計に海面上昇が起こる...</p>
<p>そうだ、宇宙に捨てよう！！！</p>
<p>重力加速度は次の式で求められます。この式によれば地球の質量 M が小さくなれば重力加速度も小さくなります。</p>
<p>$g=\frac{GM}{R^2}$</p>
<p>そもそも、1 秒の滞空時間で 150cm の垂直跳びの記録を出すために必要な重力加速度はいくらなのでしょうか？</p>
<p>$g=1.5×2^2×2=12.0$</p>
<p>あれれ、0.5 秒の滞空時間で 150cm 飛ぼうとしたら重力が今よりも強くならなければいけないことになってしまいました。</p>
<p>よくよく考えたらこれは当然で、今の地球だと 0.5 秒ではどう頑張っても 123cm しか落下できないわけです。そこを 150cm 落下しようとしたら今よりも重力が強くないといけないわけです。</p>
<p>え、じゃあ土を宇宙に捨てちゃダメじゃん。</p>
<h3 id="msi-単位系が変わった" tabindex="-1"><a class="header-anchor" href="#msi-単位系が変わった" aria-hidden="true">#</a> MSI 単位系が変わった</h3>
<p>ゴリ押しの方法である。</p>
<p>どうやってもイカちゃんの身長が 150cm を超えないのであれば、MSI 単位系が変わったことにすれば良い。</p>
<p>貨幣のデノミネーションみたいな感じで「今日の 120cm は明日の 150cm」みたいな感じにすればよいのである。これなら実際にイカちゃんの身長は 150cm になるし、物理エンジンを利用した身長の計算方法とも矛盾しないわけである。</p>
<h3 id="実はこれもダメ" tabindex="-1"><a class="header-anchor" href="#実はこれもダメ" aria-hidden="true">#</a> 実はこれもダメ</h3>
<p>何故なら 1m は厳密に光速度から定義されているため。</p>
<blockquote>
<p>1983年（昭和58年）に基準が見直され、現在は1秒の 299792458 分の1の時間に光が真空中を伝わる長さとして定義されている。</p>
<p>https://ja.wikipedia.org/wiki/メートル</p>
</blockquote>
<p>真空中の光速度は相対性理論によると不変のはずなので、もちろん 12000 年後も変わっていない。</p>
<p>「299792458 分の 1 秒～」のところを変えれば 1m の定義も変わるのだが、わざわざ変える意味がない。享楽的で単細胞なインクリングであれば人類が残した MSI 単位系を面倒くさい作業をして変えるとは考えにくい。</p>
<h3 id="ヒメちゃんがサバを読んでいる" tabindex="-1"><a class="header-anchor" href="#ヒメちゃんがサバを読んでいる" aria-hidden="true">#</a> ヒメちゃんがサバを読んでいる</h3>
<p>意外とこれが一番ありそうだったりして。</p>
<p>しかし、インクリングが 123cm というのが正しいのであればヒメちゃんは 20cm 近くもサバを読んでいることになる。</p>
<p>スポーツ選手や格闘家が相手に舐められないように 1 ~ 2cm 身長を高く申告したりする場合があるようだが、流石に 20cm もサバを読んだらあっという間にバレるのではないだろうか？</p>
<p>いや、でもそこは享楽的なインクリングは「ヒメちゃんなんか身長小さいな」くらいで済ましてしまうかもしれない...</p>
<h2 id="まとめ" tabindex="-1"><a class="header-anchor" href="#まとめ" aria-hidden="true">#</a> まとめ</h2>
<p>物理エンジンが正しいと仮定した場合、イカちゃんの身長は 120 ~ 130cm 前後であることがわかりました（他のインクリングをジャンプできないことからも 130cm の方が近いと思われる）</p>
<p>しかし、ヒメ先輩と身長を比較すると明らかに自称 145cm のヒメ先輩のほうが身長が低く、130cm というのは考えにくいです。</p>
<p>逆に「ひと跳び 150cm」を根拠に他のインクリングをジャンプで越えられないことから 155cm くらいと考えたほうがまだ納得がいきます。</p>
<p>というわけで、今回の検証からはインクリングの身長に関しては「130cm 前後でヒメちゃんがサバを読んでいる」か「155cm 前後で物理法則を含む世界の法則が乱れた（もしくは物理エンジンが正確なものをわざと使用していない）」という結論が得られました。</p>
<p>少なくとも身長が 1m イカだとか、そういうことはなさそうです。</p>
<p>記事は以上。</p>
</template>
