<template><h2 id="airpods-pro-とは" tabindex="-1"><a class="header-anchor" href="#airpods-pro-とは" aria-hidden="true">#</a> AirPods Pro とは</h2>
<p>アップルが販売しているワイヤレスイヤホンの中で最上位モデルのもの。</p>
<p>値段は三万円弱もするので完全に高級品である。</p>
<p>値段が高いだけ合って機能も充実している。一例を挙げると、</p>
<ul>
<li>アクティブノイズキャンセリング</li>
<li>外部音取り込みモード</li>
<li>アダプティブイコライゼーション</li>
<li>ハイダイナミックレンジアンプ</li>
<li>ダイナミックヘッドトラッキング</li>
<li>IPX4 に対応した耐水機能</li>
<li>H1 ベースの SiP チップ搭載</li>
</ul>
<p>となっている。ノイズキャンセリング機能は Pro の目玉機能の一つでもあるだろう。</p>
<p>よくあるアマゾンで紹介されているパチモンはノイズキャンセリング対応と書いてあるが、この値段で対応しているなんてことはないだろう。</p>
<p>しかもちゃっかり本家より上の IPX7 の防水耐性があると書いてある。IPX7 といえば完全に水の中に沈めてしまっても一定時間であれば大丈夫というレベルの防水耐性である。本当に大丈夫なのだろうか。</p>
<p>同じく IPX7 対応のイヤホンである Noble FALCON は 10000 円以上もするのだが。</p>
<h3 id="パチモンにないことが多い機能" tabindex="-1"><a class="header-anchor" href="#パチモンにないことが多い機能" aria-hidden="true">#</a> パチモンにないことが多い機能</h3>
<ul>
<li>H1 チップ
<ul>
<li>H1 チップが搭載されていないとただの Bluetooth イヤホンと同じです</li>
</ul>
</li>
<li>耳自動検出機能
<ul>
<li>イヤホンを二つとも外すと自動的に音楽が止まり、つけると再び再生が始まるという機能</li>
<li>地味に便利だなと思っている</li>
</ul>
</li>
<li>ノイズキャンセリング機能
<ul>
<li>パチモンだと本来は外音を取り込むためにイヤホンメッシュになっているところがただ黒く塗りつぶされただけになっていたりする</li>
</ul>
</li>
</ul>
<p>今回購入した JR-T03S PRO 全ての機能を備えていたのですごく満足しています。</p>
<h2 id="公式サイトで買ってみた" tabindex="-1"><a class="header-anchor" href="#公式サイトで買ってみた" aria-hidden="true">#</a> 公式サイトで買ってみた</h2>
<p><a href="https://www.joom.com/en" target="_blank" rel="noopener noreferrer">Joom. Easy shopping, fast shipping<OutboundLink/></a></p>
<p>ぼくが買ったときにはすでに残り数個だったのですが、もう売り切れてしまったようです。</p>
<p>JR-T03 とか JR-T03S とかありますけど、JR-T03S PRO なのでちゃんと買う前には S がついているか、PRO がついているかの確認をしましょう。</p>
<p>PRO じゃないやつなら結構あるんですけどね、なぜかこのモデルは品薄のようで Aliexpress や Alibaba でも見つかりませんでした。</p>
<p><img src="https://pbs.twimg.com/media/Ewq1xVNUcAI-p_H?format=png" alt=""></p>
<p>マイナーモデルチェンジ版は微妙に外の箱のイヤホンの配置が違うのでここでまずは区別をつけると良いかもしれません。</p>
<p><img src="https://pbs.twimg.com/media/Ewq1xVkUYAEzCK6?format=png" alt=""></p>
<p>AirPods Pro と同じような感じですが、ロゴが入っているので違うとわかります。</p>
<p><img src="https://pbs.twimg.com/media/Ewq1xXAUYAA29IM?format=png" alt=""></p>
<p>H1 チップ搭載なのでノイズキャンセリングや外部音取り込みモードの表示も出ます。</p>
<p>H1 チップが搭載されていても実際にはノイズキャンセリングできないイヤホンもあるのですが、これはちゃんと使えました。</p>
<p>ただ、ソニー製のノイズキャンセリングを知っているのでそれに比べたらやはりワンランク劣っていると感じました。</p>
<p><img src="https://pbs.twimg.com/media/Ewq1xWYVIAAxopf?format=png" alt=""></p>
<p>ちゃんと JR-T03S Pro と表示されます。</p>
<p>旧モデルだと本体バッテリーが常に 100%を返す意味のない状態になっていたらしいのですが、これは大丈夫でした。</p>
<p>ただ、なぜか右側のイヤホンだけバッテリーがやたらと少ないです。</p>
<h2 id="使ってみた感想" tabindex="-1"><a class="header-anchor" href="#使ってみた感想" aria-hidden="true">#</a> 使ってみた感想</h2>
<p>うるさかったパソコンのファンの音が聞こえなくなる程度のノイズキャンセリングはあったので、その点は非常に高評価です。</p>
<p>外せば音が止まるのもいるのかどうか微妙だったのですが、実際に使ってみるといい感じでした。</p>
<p>面白そうだったのであのあと調べてなんとか Alibaba の通販サイトを見つけたので複数ロットで買って日本で売ったら儲かるんじゃないかなあとか考えています。</p>
<p>ただ、なんかクレジットカード決済が拒否されてしまったので（おそらく海外扱いのため）Paypal 払いができないか相談してみることにします。</p>
<p>記事は以上。</p>
</template>
